#Область СлужебныеПроцедурыИФункции

Процедура ВыводДопРеквизитов(Форма) Экспорт     
	
	ИмяФормы = Форма.ИмяФормы;  
	
	ДобавляемыеРеквизиты = Новый Массив;
	
	Если ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" Тогда 
		НовыйКвалификаторЧисла = Новый КвалификаторыЧисла(5,2);
		Массив = Новый Массив;
		Массив.Добавить(Тип("Число"));
		ТипРеквизита = Новый ОписаниеТипов(Массив, , ,НовыйКвалификаторЧисла);
		
		РеквизитФормы = Новый РеквизитФормы("СогласованнаяСкидка", ТипРеквизита, ,"Согласованная скидка");
		ДобавляемыеРеквизиты.Добавить(РеквизитФормы); 
	КонецЕсли;	  
	
	ТипРеквизита = Новый ОписаниеТипов("СправочникСсылка.КЛ_КонтактныеЛица");
	РеквизитФормы = Новый РеквизитФормы("КонтактноеЛицо", ТипРеквизита, ,"Контактное лицо");
	ДобавляемыеРеквизиты.Добавить(РеквизитФормы);   
	
	
	Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	Если ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" Тогда 
		ДобавитьКомандуНаФорму(Форма); 
		ДобавитьГруппаКЛСкидкаВГруппаШапкаЛево(Форма); 
		ДобавитьПолеВГруппаШапкаПраво(Форма);
		ДобавитьПолеВГруппаКЛСкидка(Форма);  
		ДобавитьКнопкуВГруппаКЛСкидка(Форма);
	ИначеЕсли ИмяФормы = "Документ.ОплатаОтПокупателя.Форма.ФормаДокумента" Тогда 
		ПолеОриентир = Форма.Элементы.Основание;
		ДобавитьПолеНаФормуПослеДоговора(Форма, ПолеОриентир);	
	ИначеЕсли ИмяФормы = "Документ.ОплатаПоставщику.Форма.ФормаДокумента" Тогда
		ПолеОриентир = Форма.Элементы.СуммаДокумента;
		ДобавитьПолеНаФормуПослеДоговора(Форма, ПолеОриентир);	
	ИначеЕсли ИмяФормы = "Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокумента" Тогда  
		ДобавитьПолеВГруппаШапкаПраво(Форма);	
	ИначеЕсли ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда	
		ДобавитьПолеВГруппаШапкаПраво(Форма);	
	КонецЕсли;
	
КонецПроцедуры     

Процедура ДобавитьГруппаКЛСкидкаВГруппаШапкаЛево(Форма)  
	
	Группа = Форма.Элементы.Добавить("ГруппаКЛСкидка", Тип("ГруппаФормы"), Форма.Элементы.ГруппаШапкаЛево);
    Группа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	Группа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда; 
	
КонецПроцедуры

Процедура ДобавитьПолеВГруппаКЛСкидка(Форма)  

	ПолеВвода = Форма.Элементы.Добавить("СогласованнаяСкидка", Тип("ПолеФормы"), Форма.Элементы.ГруппаКЛСкидка); 
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.КЛ_СогласованнаяСкидка";
	ПолеВвода.УстановитьДействие("ПриИзменении", "СогласованнаяСкидкаПриИзменении"); 
	
	Форма.Элементы.ТоварыСкидка.Видимость = Ложь;
	
КонецПроцедуры

Процедура ДобавитьПолеВГруппаШапкаПраво(Форма)  

	ПолеВвода = Форма.Элементы.Добавить("КонтактноеЛицо", Тип("ПолеФормы"), Форма.Элементы.ГруппаШапкаПраво); 
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.КЛ_КонтактноеЛицо";
	
КонецПроцедуры

Процедура ДобавитьПолеНаФормуПослеДоговора(Форма, ПолеОриентир) 
	
	ПолеВвода = Форма.Элементы.Вставить("КонтактноеЛицо", Тип("ПолеФормы"),, ПолеОриентир); 
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.КЛ_КонтактноеЛицо";	
	
КонецПроцедуры  

Процедура ДобавитьКнопкуВГруппаКЛСкидка(Форма)     

    Кнопка = Форма.Элементы.Добавить("ПересчитатьДокумент", Тип("КнопкаФормы"), Форма.Элементы.ГруппаКЛСкидка);
    Кнопка.Заголовок = "Пересчитать документ";  
	Кнопка.ИмяКоманды = "КомандаПересчитатьДокумент"; 
	Кнопка.Вид = ВидКнопкиФормы.ОбычнаяКнопка; 
	Кнопка.Картинка = БиблиотекаКартинок.Обновить;
	Кнопка.Отображение = ОтображениеКнопки.КартинкаИТекст;
	
КонецПроцедуры

Процедура ДобавитьКомандуНаФорму(Форма) 
	
	КомандаПересчитатьДокумент = Форма.Команды.Добавить("КомандаПересчитатьДокумент");
	КомандаПересчитатьДокумент.Заголовок = "Пересчитать документ";
	КомандаПересчитатьДокумент.Действие = "ПересчитатьДокумент";  
	
КонецПроцедуры


#КонецОбласти


