Процедура ВыводДопРеквизитов(Форма) Экспорт     
	
	ИмяФормы = Форма.ИмяФормы;  
	
	ДобавляемыеРеквизиты = Новый Массив;
	
	ТипРеквизита = Новый ОписаниеТипов("СправочникСсылка.КЛ_КонтактныеЛица");
	РеквизитФормы = Новый РеквизитФормы("КонтактноеЛицо", ТипРеквизита, ,"Контактное лицо");
	ДобавляемыеРеквизиты.Добавить(РеквизитФормы);   
	
	
	Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	Если ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" Тогда 
		ДобавитьПолеВГруппаШапкаПраво(Форма);
	ИначеЕсли ИмяФормы = "Документ.ОплатаОтПокупателя.Форма.ФормаДокумента" Тогда 
		ПолеОриентир = Форма.Элементы.Основание;
		ДобавитьПолеНаФормуПослеДоговора(Форма, ПолеОриентир);	
	ИначеЕсли ИмяФормы = "Документ.ОплатаПоставщику.Форма.ФормаДокумента" Тогда
		ПолеОриентир = Форма.Элементы.СуммаДокумента;
		ДобавитьПолеНаФормуПослеДоговора(Форма, ПолеОриентир);	
	ИначеЕсли ИмяФормы = "Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокумента" Тогда  
		ДобавитьПолеВГруппаШапкаПраво(Форма);	
	ИначеЕсли ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда	
		ДобавитьПолеВГруппаШапкаПраво(Форма);	
	КонецЕсли;
	
КонецПроцедуры     

Процедура ДобавитьПолеВГруппаШапкаПраво(Форма)  

	ПолеВвода = Форма.Элементы.Добавить("КонтактноеЛицо", Тип("ПолеФормы"), Форма.Элементы.ГруппаШапкаПраво); 
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.КЛ_КонтактноеЛицо";
	
КонецПроцедуры

Процедура ДобавитьПолеНаФормуПослеДоговора(Форма, ПолеОриентир) 
	
	ПолеВвода = Форма.Элементы.Вставить("КонтактноеЛицо", Тип("ПолеФормы"),, ПолеОриентир); 
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.КЛ_КонтактноеЛицо";	
	
КонецПроцедуры  
